Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SEMC.h
/*! @name DCCR - Delay Chain Control Register */
/*! @{ */

#define SEMC_DCCR_SDRAMEN_MASK                   (0x1U)
#define SEMC_DCCR_SDRAMEN_SHIFT                  (0U)
/*! SDRAMEN - Delay chain insertion enable for SRAM device.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SDRAMEN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SDRAMEN_SHIFT)) & SEMC_DCCR_SDRAMEN_MASK)

#define SEMC_DCCR_SDRAMVAL_MASK                  (0x3EU)
#define SEMC_DCCR_SDRAMVAL_SHIFT                 (1U)
/*! SDRAMVAL - Clock delay line delay cell number selection value for SDRAM device. */
#define SEMC_DCCR_SDRAMVAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SDRAMVAL_SHIFT)) & SEMC_DCCR_SDRAMVAL_MASK)

#define SEMC_DCCR_NOREN_MASK                     (0x100U)
#define SEMC_DCCR_NOREN_SHIFT                    (8U)
/*! NOREN - Delay chain insertion enable for NOR device.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_NOREN(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_NOREN_SHIFT)) & SEMC_DCCR_NOREN_MASK)

#define SEMC_DCCR_NORVAL_MASK                    (0x3E00U)
#define SEMC_DCCR_NORVAL_SHIFT                   (9U)
/*! NORVAL - Clock delay line delay cell number selection value for NOR device. */
#define SEMC_DCCR_NORVAL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_NORVAL_SHIFT)) & SEMC_DCCR_NORVAL_MASK)

#define SEMC_DCCR_SRAM0EN_MASK                   (0x10000U)
#define SEMC_DCCR_SRAM0EN_SHIFT                  (16U)
/*! SRAM0EN - Delay chain insertion enable for SRAM device 0.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SRAM0EN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAM0EN_SHIFT)) & SEMC_DCCR_SRAM0EN_MASK)

#define SEMC_DCCR_SRAM0VAL_MASK                  (0x3E0000U)
#define SEMC_DCCR_SRAM0VAL_SHIFT                 (17U)
/*! SRAM0VAL - Clock delay line delay cell number selection value for SRAM device 0. */
#define SEMC_DCCR_SRAM0VAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAM0VAL_SHIFT)) & SEMC_DCCR_SRAM0VAL_MASK)

#define SEMC_DCCR_SRAMXEN_MASK                   (0x1000000U)
#define SEMC_DCCR_SRAMXEN_SHIFT                  (24U)
/*! SRAMXEN - Delay chain insertion enable for SRAM device 1-3.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SRAMXEN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAMXEN_SHIFT)) & SEMC_DCCR_SRAMXEN_MASK)

#define SEMC_DCCR_SRAMXVAL_MASK                  (0x3E000000U)
#define SEMC_DCCR_SRAMXVAL_SHIFT                 (25U)
/*! SRAMXVAL - Clock delay line delay cell number selection value for SRAM device 1-3. */
#define SEMC_DCCR_SRAMXVAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAMXVAL_SHIFT)) & SEMC_DCCR_SRAMXVAL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SEMC_Register_Masks */


/*!
 * @}
 */ /* end of group SEMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SEMC_H_ */

